W7D3/music_app/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "5LrrAdFW-PwS0lhigrKAJg"], ["updated_at", "2020-03-25 21:19:03.868756"], ["id", 1]]