W6D4/app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    #debugger
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Javi2"], ["updated_at", "2020-03-19 22:10:30.207163"], ["id", 2]]