W11D4/benchbnb/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "xlzAnjhKWe4Pg5wvFUveDg"], ["updated_at", "2020-04-23 18:02:55.517267"], ["id", 3]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!