W7D1/cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @cat_list = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @single_cat = Cat.find(params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @single_cat = Cat.new(cat_params)
        if @single_cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @single_cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Purple"], ["description", "            Lazy kitty\r\n        "], ["updated_at", "2020-03-24 03:59:48.985000"], ["id", 3]]
---
    def update
        @single_cat = Cat.find(params[:id])
        if @single_cat.update(cat_params)