W11D5/benchbnb/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
---
    def index
        @benches = Bench.all

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Mission Bench"], ["lat", 37.757307], ["lng", -122.4146], ["created_at", "2020-04-24 18:01:33.342800"], ["updated_at", "2020-04-24 18:01:33.342800"]]
---
    def create
        @bench = Bench.new(bench_params)
        if @bench.save