W10D5/todos_api/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
    def index
        todos = Todo.all