W6D5/app/controllers/artworks_controller.rb

    def index
        #debugger
        id = params[:user_id]
        #artworks = Artwork.all.where(artist_id: id).(User.find(id).shared_artworks)
        artwork = Artwork
          .joins(:artist, :shared_viewers)
          .where('shared_viewers_artworks.id = :id OR  artist_id = :id', {id: id})
---
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artworks"."id" = "artwork_shares"."artwork_id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 1]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "work_four"], ["updated_at", "2020-03-20 17:19:51.443249"], ["id", 5]]

    def create
        artwork = Artwork.create(artwork_params)
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "work_three"], ["image_url", "work_three.com"], ["artist_id", 4], ["created_at", "2020-03-20 17:18:49.893361"], ["updated_at", "2020-03-20 17:18:49.893361"]]