W6D5/app/controllers/artwork_shares_controller.rb

  def create
    #debugger
    artwork_share = ArtworkShare.create(artworkshare_params)
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 5], ["created_at", "2020-03-20 18:06:46.635736"], ["updated_at", "2020-03-20 18:06:46.635736"]]