W6D5/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users"."id", "users"."username" FROM "users" WHERE "users"."username" = $1  [["username", "taco"]]
SELECT "users".* FROM "users"
---
  def index
    #debugger
    if params[:id]
      render json: User.find(params[:id])
    elsif params[:username]
      render json:  User.all.where(username: params[:username])
    else
        render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "javi@gmail.com"], ["updated_at", "2020-03-19 22:06:10.150342"], ["id", 2]]
---
  def update
    user = User.find(params[:id])
    #debugger
    if user.update(user_params)

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "Clifford"]]
---
  def create
    user = User.new(user_params)

    if user.save