W7D3/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Within Temptation"], ["created_at", "2020-03-25 23:28:46.681152"], ["updated_at", "2020-03-25 23:28:46.681152"]]
---
    def create
        band = Band.new(band_params)
        if band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Lacuna Coilll"], ["updated_at", "2020-03-25 23:42:35.017042"], ["id", 3]]
---
    def update
        band = Band.find(params[:id])
        if band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
    def destroy
        band = Band.find(params[:id])
        band.destroy